//############################################################################
//      
/*!
@brief      Theolizerライブラリの標準コンテナ・サポート
@ingroup    TheolizerLib
@file       containers.h
@author     Yoshinori Tahara(Theoride Technology)
@date       2016/07/18 Created
*/
/*
    Copyright (c) 2016 Yohinori Tahara(Theoride Technology) - http://theolizer.com/

    商用ライセンス
        有効なTheolizer商用ライセンスを保持している人は、
        田原良則(Theoride Technology)と締結している商用ライセンス契約の
        使用条件に従って、このファイルを取り扱うことができます。

    General Public License Version 3(以下GPLv3)
        Free Software Foundationが公表するGPLv3の使用条件に従って、
        あなたはこのファイルを取り扱うことができます。
        GPLv3の内容を https://www.gnu.org/licenses/gpl.txt にて確認して下さい。
        GPLv3のコピーをLICENSE.TXTファイルにおいてます。
*/
//############################################################################

#if !defined(THEOLIZER_INTERNAL_CONTAINERS_H)
#define THEOLIZER_INTERNAL_CONTAINERS_H


//############################################################################
//      Begin
//############################################################################

// ***************************************************************************
//          DLL用の警告禁止
// ***************************************************************************

#ifdef _MSC_VER
  #pragma warning(push)
//#pragma warning(disable:4100 4251)
#endif

//############################################################################
//      グローバル名前空間
//############################################################################

// ***************************************************************************
//      標準コンテナのデフォルト・パラメータ
// ***************************************************************************

//----------------------------------------------------------------------------
//      allocator<T>
//----------------------------------------------------------------------------

THEOLIZER_TEMPLATE_PARAMETER_TEMPLATE((template<class T>),
                                      std::allocator, (T),
                                      allocatorTheolizer);

//############################################################################
//      End
//############################################################################

// ***************************************************************************
//          警告抑止解除
// ***************************************************************************

#ifdef _MSC_VER
  #pragma warning(pop)
#endif

#endif  // THEOLIZER_INTERNAL_CONTAINERS_H
